app/controllers/agents_controller.rb

  def index
    @page_id = "agents"
    @agents = Agent.all
---
SELECT * FROM "agents"

  def show
    @page_id = "agents"
    @agent = Agent.find(params[:id])
---
SELECT * FROM "agents" WHERE ("agents"."id" = 1)

  def edit
    @page_id = "agents"
    @agent = Agent.find(params[:id])
---
SELECT * FROM "agents" WHERE ("agents"."id" = 1)

  def create
    @agent = Agent.new(params[:agent])

    respond_to do |format|
      if @agent.save
---
INSERT INTO "agents" ("name", "belief", "created_at", "updated_at", "disbelief", "uncertainty") VALUES('A', 1.0, '2010-10-24 13:57:59', '2010-10-24 13:57:59', 0.0, 0.0)

  def update
    @agent = Agent.find(params[:id])

    respond_to do |format|
      if @agent.update_attributes(params[:agent])
---
SELECT * FROM "agents" WHERE ("agents"."id" = 1)
UPDATE "agents" SET "updated_at" = '2010-12-02 08:46:15', "belief" = 0.95, "uncertainty" = 0.05 WHERE "id" = 2

  def parse_csv
    Agent.delete_all
    params[:csv].each_line do |line|
      a_name, a_belief, a_disbelief, a_uncertainty = line.strip.split(';')

      Agent.create(
          :name => a_name,
          :belief => a_belief,
          :disbelief => a_disbelief,
          :uncertainty => a_uncertainty)
---
DELETE FROM "agents" WHERE 1=1
INSERT INTO "agents" ("name", "belief", "updated_at", "uncertainty", "disbelief", "created_at") VALUES('A', 1.0, '2010-12-09 13:55:54', 0.0, 0.0, '2010-12-09 13:55:54')