app/controllers/atomic_services_controller.rb

SELECT * FROM "atomic_services"
---
  def index
    @atomic_services = AtomicService.all

SELECT * FROM "atomic_services" WHERE ("atomic_services"."id" = 1)
---
  def show
    @atomic_service = AtomicService.find(params[:id])

INSERT INTO "atomic_services" ("complex_service_id", "created_at", "updated_at", "service_id") VALUES(1, '2010-10-24 13:58:32', '2010-10-24 13:58:32', 1)
---
  def create
    @atomic_service = AtomicService.new(params[:atomic_service])

    respond_to do |format|
      if @atomic_service.save