app/controllers/complex_services_controller.rb

SELECT * FROM "complex_services"
---
  def index
    @complex_services = ComplexService.all

SELECT * FROM "complex_services" WHERE ("complex_services"."id" = 1)
SELECT * FROM "services" WHERE ("services"."id" = 1)
UPDATE "complex_services" SET "updated_at" = '2010-10-24 20:25:23', "belief" = 0.47350019193858, "disbelief" = 0.0604606525911708, "uncertainty" = 0.46603915547025 WHERE "id" = 1
---
  def opinion
	@complex_service = ComplexService.find(params[:id])
	@opinion = @complex_service.opinion
	@complex_service.update_attributes(:belief => @opinion.belief, :disbelief=> @opinion.disbelief, :uncertainty=> @opinion.uncertainty)

SELECT * FROM "complex_services" WHERE ("complex_services"."id" = 1)
---
  def show
    @complex_service = ComplexService.find(params[:id])

INSERT INTO "complex_services" ("name", "belief", "created_at", "updated_at", "disbelief", "uncertainty") VALUES('PierwszaZlozona', 0.0, '2010-10-24 13:59:35', '2010-10-24 13:59:35', 0.0, 0.0)
---
  def create
    @complex_service = ComplexService.new(params[:complex_service])

    respond_to do |format|
      if @complex_service.save