app/controllers/opinions_controller.rb

SELECT * FROM "opinions"
SELECT * FROM "agents"
SELECT * FROM "services"
---
  def index
    @page_id = "opinions"
    @opinions = Opinion.all
    services = Service.find(:all)
    agents = Agent.all
    @agents_list = agents.collect {|item| [ item.name, item.id ]}
    @agents_table = agents.inject({}) {|h,i| h[i.id] = i.name; h}
    @services_list = services.collect {|item| [ item.name, item.id ]}

SELECT * FROM "opinions" WHERE ("opinions"."id" = 1)
---
  def recommend
	@opinion = Opinion.find(params[:id])

SELECT * FROM "opinions" WHERE ("opinions"."id" = 1)
---
  def show
    @page_id = "opinions"
    @opinion = Opinion.find(params[:id])

SELECT * FROM "opinions" WHERE ("opinions"."id" = 1)
SELECT * FROM "agents"
---
  def edit
    @page_id = "opinions"
    @opinion = Opinion.find(params[:id])
    @agents = Agent.all.collect {|item| [ item.name, item.id ]}

INSERT INTO "opinions" ("belief", "updated_at", "service_id", "uncertainty", "disbelief", "agent_id", "created_at") VALUES(0.7, '2010-11-23 21:45:11', 1, 0.1, 0.2, 1, '2010-11-23 21:45:11')
---
  def create
    @opinion = Opinion.new(params[:opinion])

    respond_to do |format|
      if @opinion.save

SELECT * FROM "opinions" WHERE ("opinions"."id" = 1)
UPDATE "opinions" SET "updated_at" = '2010-12-02 08:43:59', "belief" = 0.95, "disbelief" = 0.0, "uncertainty" = 0.05 WHERE "id" = 12
---
  def update
    @opinion = Opinion.find(params[:id])

    respond_to do |format|
      if @opinion.update_attributes(params[:opinion])

SELECT * FROM "opinions" WHERE ("opinions"."id" = 6)
DELETE FROM "opinions" WHERE "id" = 6
---
  def destroy
    @opinion = Opinion.find(params[:id])
    @opinion.destroy

DELETE FROM "opinions" WHERE 1=1
SELECT * FROM "agents"
INSERT INTO "opinions" ("belief", "updated_at", "service_id", "uncertainty", "disbelief", "agent_id", "created_at") VALUES(1.0, '2010-12-09 14:17:19', 374, 0.0, 0.0, 8, '2010-12-09 14:17:19')
---
    def parse_csv
    Opinion.delete_all
    agents = Agent.all
    agents_table = agents.inject({}) {|h,i| h[i.name] = i.id; h}
    services = Service.find(:all)
    services_table = services.inject({}) {|h, i| h[i.name] = i.id; h}
    params[:csv].each_line do |line|
      o_agent, o_service, o_belief, o_disbelief, o_uncertainty = line.strip.split(';')

      Opinion.create(
          :agent_id => agents_table[o_agent],
          :service_id => services_table[o_service],
          :belief => o_belief,
          :disbelief => o_disbelief,
          :uncertainty => o_uncertainty)

INSERT INTO "complex_services" ("name", "belief", "updated_at", "uncertainty", "disbelief", "created_at") VALUES(NULL, NULL, '2010-11-25 01:10:51', NULL, NULL, '2010-11-25 01:10:51')
SELECT * FROM "services" WHERE ("services"."id" = 1)
---
def get_opinion
    atomic_service_array = Hash.from_xml(params["complex_service"])['services'].to_a
    #atomic_service_array = Hash.from_xml("<?xml version=\"1.0\" encoding=\"UTF-8\"?><services><service><id>1</id></service><service><id>2</id></service><service><id>3</id></service></services>")['services']['service'].to_a.flatten

    complex_service = Array.new
    atomic_service_array.each do |item|
      complex_service << Service.find(item["id"])