app/controllers/services_controller.rb

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

  def consensus
	@service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)